Revit 2024 API
AnalyticalPanel.Create Method (Document, Curve, XYZ)
 Creates a new instance of an Analytical Panel within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static AnalyticalPanel Create(
	Document document,
	Curve profile,
	XYZ normal
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	profile As Curve, _
	normal As XYZ _
) As AnalyticalPanel
Visual C++
public:
static AnalyticalPanel^ Create(
	Document^ document,
	Curve^ profile,
	XYZ^ normal
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Revit document.
profile
Type: Autodesk.Revit.DB.Curve
 Curve which represents the profile of the Analytical Panel.
normal
Type: Autodesk.Revit.DB.XYZ
 Normal used for the extrusion of the profile.
Return Value
 The newly created AnalyticalPanel instance.
Remarks
 Profile can be a line, an arc or an ellipse. In case of arcs and ellipses, the normal should be perpendicular to the profile plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The profile argument is not valid for analytical panel creation. -or- The input profile is not bound. -or- The normal argument is not valid for analytical panel creation.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Failed to create the analytical panel.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
AnalyticalPanel Class
Create Overload
Autodesk.Revit.DB.Structure Namespace